app/Controllers/MatchController.php

    public function create()
    {
        helper('my_date_helper');
        $data=$this->request->getJSON();
        $equipe_tournoi_model = new EquipeTournoiJModel();
        if($data->id_equipe_tournoi_1 == $data->id_equipe_tournoi_2){
            return $this->respond(array('error'=>'Les équipes doivent être différentes','data'=>null,'status'=>0));
        }
        $eq_t_1=$equipe_tournoi_model->find($data->id_equipe_tournoi_1);
        if(!$eq_t_1){
            return $this->respond(array('error'=>'L\'équipe 1 choisie ne participe pas à ce tournoi','data'=>null,'status'=>0));
        }
        $eq_t_2=$equipe_tournoi_model->find($data->id_equipe_tournoi_2);
        if(!$eq_t_2){
            return $this->respond(array('error'=>'L\'équipe 2 choisie ne participe pas à ce tournoi','data'=>null,'status'=>0));
        }

        if(is_valid_date($data->date_)==false){
            return $this->respond(array('error'=>'Date invalide','data'=>null,'status'=>0));
        }

        if(is_before($data->debut_prevision, $data->fin_prevision)==false){
            return $this->respond(array('error'=>'L\'heure de début doit être antérieure à l\'heure de fin','data'=>null,'status'=>0));
        }
        $discpline_model = new DisciplineJModel();
        $discipline=$discpline_model->find($data->id_discipline);
---
SELECT *
FROM "equipe_tournoi"
WHERE "equipe_tournoi"."id_equipe_tournoi" = '1'
SELECT *
FROM "equipe_tournoi"
WHERE "equipe_tournoi"."id_equipe_tournoi" = '2'
SELECT *
FROM "discipline"
WHERE "discipline"."id_discipline" = '1'

            return $this->respond(array('error'=>'Type de match invalide','data'=>null,'status'=>0));
        }
        $model = new MatchModel();
        $match=$model->insert($data);
---
INSERT INTO "match" ("id_equipe_tournoi_1", "id_equipe_tournoi_2", "date_", "debut_prevision", "fin_prevision", "id_discipline", "id_type") VALUES ('1', '2', '2024-12-14', '20:00:00', '22:00:00', '1', '1')

    public function update_score(){
        $model = new MatchModel();
        $data=$this->request->getJSON();
        $match = $model->find($data->idmatch);
---
SELECT *
FROM "match"
WHERE "match"."id_match" = 16