app/Controllers/MatchJController.php

    public function get_matche_eliminatoire_en_cours_par_discipline($id_discipline = null): ResponseInterface
    {
        $db = \Config\Database::connect();
        $builder = $db->table('match');
        $builder->select('match.*, e1.nom_equipe as nom_equipe_1, e2.nom_equipe as nom_equipe_2');
        $builder->join('equipe_tournoi as et1', 'et1.id_equipe_tournoi = match.id_equipe_tournoi_1');
        $builder->join('equipe as e1', 'e1.id_equipe = et1.id_equipe');
        $builder->join('equipe_tournoi as et2', 'et2.id_equipe_tournoi = match.id_equipe_tournoi_2');
        $builder->join('equipe as e2', 'e2.id_equipe = et2.id_equipe');
        $builder->where('id_discipline', $id_discipline);
        $builder->where('id_type > 1');
        $builder->where('debut_reel IS NOT NULL', null, false);
        $builder->where('fin_reel IS NULL', null, false);
        // Afficher la requête SQL générée
        // $sql = $builder->getCompiledSelect();
        // echo $sql;
        $query = $builder->get();
---
SELECT "match".*, "e1"."nom_equipe" as "nom_equipe_1", "e2"."nom_equipe" as "nom_equipe_2"
FROM "match"
JOIN "equipe_tournoi" as "et1" ON "et1"."id_equipe_tournoi" = "match"."id_equipe_tournoi_1"
JOIN "equipe" as "e1" ON "e1"."id_equipe" = "et1"."id_equipe"
JOIN "equipe_tournoi" as "et2" ON "et2"."id_equipe_tournoi" = "match"."id_equipe_tournoi_2"
JOIN "equipe" as "e2" ON "e2"."id_equipe" = "et2"."id_equipe"
WHERE "id_discipline" = '1'
AND debut_reel IS NOT NULL
AND fin_reel IS NULL

    public function get_matche_eliminatoire_a_suivre_par_discipline($id_discipline = null): ResponseInterface
    {
        $db = \Config\Database::connect();
        $builder = $db->table('match');
        $builder->select('match.*, e1.nom_equipe as nom_equipe_1, e2.nom_equipe as nom_equipe_2');
        $builder->join('equipe_tournoi as et1', 'et1.id_equipe_tournoi = match.id_equipe_tournoi_1');
        $builder->join('equipe as e1', 'e1.id_equipe = et1.id_equipe');
        $builder->join('equipe_tournoi as et2', 'et2.id_equipe_tournoi = match.id_equipe_tournoi_2');
        $builder->join('equipe as e2', 'e2.id_equipe = et2.id_equipe');
        $builder->where('id_discipline', $id_discipline);
        $builder->where('id_type > 1');
        $builder->where('debut_reel IS NULL', null, false);
        $builder->where('fin_reel IS NULL', null, false);

        $query = $builder->get();
---
SELECT "match".*, "e1"."nom_equipe" as "nom_equipe_1", "e2"."nom_equipe" as "nom_equipe_2"
FROM "match"
JOIN "equipe_tournoi" as "et1" ON "et1"."id_equipe_tournoi" = "match"."id_equipe_tournoi_1"
JOIN "equipe" as "e1" ON "e1"."id_equipe" = "et1"."id_equipe"
JOIN "equipe_tournoi" as "et2" ON "et2"."id_equipe_tournoi" = "match"."id_equipe_tournoi_2"
JOIN "equipe" as "e2" ON "e2"."id_equipe" = "et2"."id_equipe"
WHERE debut_reel IS NULL
AND fin_reel IS NULL