app/Controllers/PouleJController.php

    public function get_classement_par_poule_choisi($id_poule = 1): ResponseInterface
    {
        try {
            $db = \Config\Database::connect();
            $builder = $db->table('v_resultat_par_equipe_tournoi vr');
            $builder->select('vr.*, e.*');
            $builder->join('equipe_tournoi et', 'et.id_equipe_tournoi = vr.id_equipe_tournoi');
            $builder->join('equipe e', 'e.id_equipe = et.id_equipe');
            $builder->where('et.id_poule', $id_poule);
            $builder->orderBy('vr.points', 'DESC');
            $query = $builder->get();
---
SELECT "vr".*, "e".*
FROM "v_resultat_par_equipe_tournoi" "vr"
JOIN "equipe_tournoi" "et" ON "et"."id_equipe_tournoi" = "vr"."id_equipe_tournoi"
JOIN "equipe" "e" ON "e"."id_equipe" = "et"."id_equipe"
WHERE "et"."id_poule" = '1'
ORDER BY "vr"."points" DESC