app/Models/MatchModel.php

    public function updateScore($data,$match)
    {
        $builder = $this->builder();
        if($data->equipe==1){
            $builder->where('id_match', $data->idmatch)
                ->set('score_equipe_1', $data->points)
                ->update();
            $match['score_equipe_1']=$data->points;
        }
        else if($data->equipe==2){
            $builder->where('id_match', $data->points)
                ->set('score_equipe_2', $data->points)
                ->update();
---
UPDATE "match" SET "score_equipe_1" = score_equipe_1 - 1 
WHERE "id_match" = 1
UPDATE "match" SET "score_equipe_2" = score_equipe_2 - 1
WHERE "id_match" = 1